99cats/app/controllers/cat_rental_requests_controller.rb

  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2016-09-07 20:28:40.491666"], ["end_date", "2024-01-01"], ["start_date", "2018-01-01"], ["status", "PENDING"], ["updated_at", "2016-09-07 20:28:40.491666"]]